> (macro)
Eval error: ...
> (macro x)
Eval error: ...
> (macro x y z)
Eval error: ...
> (macro 1 1)
Eval error: ...
