> (lambda)
Eval error: ...
> (lambda x)
Eval error: ...
> (lambda x y z)
Eval error: ...
> (lambda 1 1)
Eval error: ...
