> ((lambda (x) x) 1)
1
> ((lambda (x y) y) 1 2)
2
> ((lambda (x . y) y) 1 2 3)
(2 3)
> ((lambda x x) 1 2 3)
(1 2 3)
> (((lambda (x) (lambda () x)) 1))
1
