> (car '(1 2 3))
1
> (car 1)
Eval error: ...
> (car ())
Eval error: ...
> (car)
Eval error: ...
> (car 1 2)
Eval error: ...
