> (nil? ())
t
> (nil? 'a)
()
> (nil? 1)
()
> (nil? (cons 1 2))
()
> (nil?)
Eval error: ...
> (nil? 1 2)
Eval error: ...
