> (cdr '(1 2 3))
(2 3)
> (cdr '(1))
()
> (cdr 1)
Eval error: ...
> (cdr ())
Eval error: ...
> (cdr)
Eval error: ...
> (cdr 1 2)
Eval error: ...
