> (symbol? 'a)
t
> (symbol? 1)
()
> (symbol? (cons 1 2))
()
> (symbol?)
Eval error: ...
> (symbol? 1 2)
Eval error: ...
