> (pair? (cons 1 2))
t
> (pair? '(1 2 3))
t
> (pair? 1)
()
> (pair? 'a)
()
> (pair? ())
()
> (pair?)
Eval error: ...
> (pair? 1 2)
Eval error: ...
