> (cons 1 2)
(1 . 2)
> (cons)
Eval error: ...
> (cons 1)
Eval error: ...
> (cons 1 2 3)
Eval error: ...
